{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Desktop Support",
    "1": "Database Ops",
    "2": "Security & Access",
    "3": "Networking",
    "4": "Application Support",
    "5": "Finance",
    "6": "Database",
    "7": "Engineering",
    "8": "IT Support"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Application Support": 4,
    "Database": 6,
    "Database Ops": 1,
    "Desktop Support": 0,
    "Engineering": 7,
    "Finance": 5,
    "IT Support": 8,
    "Networking": 3,
    "Security & Access": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
